import { Comment } from './types';

export const fakeComments: Comment[] = [
  {
    id: 1,
    text: 'مقاله بسیار عالی بود! من به واقع چیزهای جدیدی یاد گرفتم و نگاه جدیدی به این موضوع پیدا کردم. سپاسگزارم برای اشتراک این محتوا.',
    author: 'جان دو',
  },
  {
    id: 2,
    text: 'این مقاله واقعا مفید بود. من برای حل یک مشکل خاص این مطلب را مطالعه کردم و توانستم بهترین راه حل را پیدا کنم. ممنون بابت به اشتراک گذاشتن این اطلاعات.',
    author: 'جین اسمیت',
  },
  {
    id: 3,
    text: 'من واقعاً علاقه‌مندم بیشتر در مورد این موضوع بدانم. می‌توانید توضیحات بیشتری درباره این نکته خاص بدهید؟ من مشتاقانه منتظر پاسخ شما هستم.',
    author: 'دیوید جانسون',
  },
  {
    id: 4,
    text: 'از کیفیت بالای این مقاله و تمام توضیحات کاربردی آن، تعجب‌زده شدم. نوشته شما را به همه دوستانم پیشنهاد خواهم کرد. ادامه بدهید!',
    author: 'سارا ویلیامز',
  },
  {
    id: 5,
    text: 'من ممکن است با برخی از نکات این مقاله مخالفت کنم، اما باز هم این یک مطلب جذاب است که ارزش بحث و بررسی را دارد. بیایید در مورد آن بیشتر صحبت کنیم و ایده‌ها را تبادل کنیم.',
    author: 'مایکل براون',
  },
];
